---
kind: type
id: T:Autodesk.Revit.UI.DockablePane
source: html/671f5ed0-09af-face-532f-72d214131cda.htm
---
# Autodesk.Revit.UI.DockablePane

A user interface pane that participates in Revit's docking window system.

## Syntax (C#)
```csharp
public class DockablePane : IDisposable
```